Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/employment_rights_and_conditions/pay_and_employment/when_you_are_regularly_paid_late.html.txt.tmx
Source language: en
Languages: ga

source: When you are regularly paid late
ga: Nuair a íoctar déanach thú go rialta

source: • Resolving the dispute with your employer
ga: • Conas iarratas a dhéanamh

source: • Making a complaint • How to apply
ga: • Cá háit a ndéanfaidh mé iarratas

source: If your employer is regularly late when paying your wages but you are still employed, then there are procedures you can use to enforce your legal right to be paid according to your terms and conditions of employment
ga: Má tá d’fhostóir déanach á d’íoc go rialta agus tú fostaithe fóill, tá nósanna imeachta gur féidir leat a chur i bhfeidhm chun do cheart dlíthiúil a fheidhmiú le bheith íoctha de réir do théarmaí agus do choinníollacha fostaíochta

source: You are entitled to be paid on time as part of your contract of employment
ga: Tá tú i dteideal a bheith íoctha in am mar chuid de do chonradh fostaíochta

source: First, you should try to resolve this dispute about pay with your employer using any internal complaint or grievances procedures that are available
ga: Ar dtús, ba chóir duit iarracht a dhéanamh an díospóid seo faoi íocaíocht a réiteach le d'fhostóir ag baint úsáide as aon nós imeachta ghearán inmheánach atá ar fáil

source: Then, if this does not work, and your employer is still paying you late, you may make a formal complaint to the Workplace Relations Commission
ga: Ansin, más rud é nach n-oibríonn seo, agus má leanann d’fhostóir ar aghaidh á d’íoc déanach, is féidir leat gearán foirmeálta a dhéanamh leis an gCoimisiún um Chaidreamh san Áit Oibre

source: At both stages of these procedures you should use any supports available, for example, a trade union or your local Citizens Information Centre to help you get your legal right to payment on time
ga: Ag an dá chéim de na nósanna imeachta seo ba chóir duit aon tacaíochtaí atá ar fáil a úsáid, mar shampla, ceardchumann nó d'Ionad Faisnéise do Shaoránaigh áitiúil chun cabhrú leat do cheart dlíthiúil a dhaingniú íocaíocht in am a fháil

source: Resolving the dispute with your employer
ga: Ag réiteach na díospóide le d'fhostóir

source: You should start by asking your employer to pay you on time and to pay any arrears of pay that are due
ga: Ba chóir duit tosú trí iarraidh ar d'fhostóir thú a íoc in am, agus riaráistí pá ar bith atá dlite a íoc

source: Your written terms of employment should state when you are paid, for example, weekly or monthly
ga: Ba chóir do do théarmaí fostaíochta scríofa a lua cén uair a n-íoctar thú, mar shampla, go seachtainiúil nó go míosúil

source: If there is a complaint or grievance procedure at your work you should use this
ga: Má tá gearán nó nós imeachta casaoide ag do láthair oibre ba chóir duit é seo a úsáid

source: The Workplace Relations Commission’s Code of Practice: Grievance and Disciplinary Procedures states that employers should have written grievance and disciplinary procedures and they should give employees copies of these at the start of their employment
ga: Deireann Cód Cleachtais: Nósanna Imeachta Casaoide agus Araíonachta an Choimisiúin um Chaidreamh san Áit Oibre gur cóir d'fhostóirí nósanna imeachta casaoide agus araíonachta i scríbhinn a bheith acu agus ba chóir dóibh cóipeanna díobh seo a thabhairt d’fhostaithe ag tús a bhfostaíochta

source: If your employer does not have a grievance procedure or if it is not possible to resolve this dispute within your workplace, you may have no other choice but to bring a complaint
ga: Mura bhfuil nós imeachta casaoide ag d’fhostóir nó más rud é nach féidir an díospóid a réiteach laistigh de do láthair oibre, d’féadfadh sé nach bhfuil rogha ar bith eile agat ach gearán a thabhairt

source: Your dispute with your employer is a trade dispute which is defined in the Industrial Relations Act 1990 as “any dispute between employers and workers which is connected with the employment or non-employment, or the terms or conditions of or affecting the employment, of any person”
ga: Is aighneas trádála é do dhíospóid le d'fhostóir atá sainmhínithe san Acht Caidrimh Thionscail 1990 mar "aon díospóid idir fhostóirí agus oibrithe atá bainteach leis an bhfostaíocht nó neamhfhostaíocht, nó na téarmaí nó coinníollacha a bhaineann le nó a chuireann isteach ar fhostaíoch duine ar bith"

source: The adjudicators of the Workplace Relations Commission have the power to investigate certain trade disputes.They investigate disputes, grievances and claims that individuals or small groups of workers make under a range of employment legislation
ga: Faoi alt 13 den Acht Caidrimh Thionscail 1969 tá an chumhacht ag na breithneoirí an Choimisiúin um Chaidreamh san Áit Oibre imscrúdú a dhéanamh ar dhíospóidí trádála áirithe. Déanann siad imscrúdú ar dhíospóidí, ar ghearáin agus ar éilimh a dhéanann daoine aonair nó grúpaí beaga oibrithe faoi reachtaíocht fostaíochta ar leith

source: Your complaint is not covered by specific legislation such as the Payment of Wages Act 1991
ga: Níl do ghearán clúdaithe faoi reachtaíocht áirithe cosúil leis an Acht um Íoc Pá 1991

source: Instead, your complaint, which is a trade dispute as defined above, should be made under the Industrial Relations Acts 1969-2015 – see ‘How to apply’ below
ga: Ina áit sin, ba chóir duit do ghearán, atá ina aighneas ceirde mar atá sainithe thuas, a dhéanamh faoi na hAchtanna Caidrimh Thionscail 1969-2001 – féach 'Conas iarratas a dhéanamh' thíos

source: Under this legislation if your employer objects to an adjudicator hearing you would have to refer the matter to the Labour Court
ga: De réir na reachtaíochta seo, má chuireann d'fhostóir i gcoinne éisteachta an bhreithneora bheadh ort an t-ábhar a tharchur chuig an gCúirt Oibreachais

source: Following the investigation of your complaint, the adjudicator issues a decision
ga: Tar éis an t-imscrúdú a dhéanamh ar do ghearán, eisíonn an breithneoir moladh

source: Either of you may appeal this decision to the Labour Court
ga: Níl an moladh seo ina cheangal ort nó ar d'fhostóir

source: Alternatively you could make a complaint under the Terms of Employment (Information) Acts 1994 and 2001 – see ‘How to apply’ below
ga: Is féidir leat gearán a dhéanamh faoin Acht um Théarmaí Fostaíochta (Faisnéis) 1994 agus 2001, ina ionad sin – féach 'Conas iarratas a dhéanamh' thíos

source: If you are regularly being paid late, this means you are not being paid in accordance with your written terms of employment
ga: Má tá tú á íoc déanach go rialta, ciallaíonn sé seo nach bhfuil tú á íoc i gcomhréir le do chuid téarmaí fostaíochta scríofa

source: If you are consistently paid late by your employer you may also consider that you have no choice but to resign and claim constructive dismissal because your employer has breached the terms of your contract
ga: Má tá tú á íoc déanach go seasta ag d'fhostóir is féidir leat a mheas nach bhfuil aon rogha agat seachas éirí as do phost agus dífhostú inchiallaithe a éileamh de bharr go bhfuil d'fhostóir tar éis téarmaí do chonartha a shárú

source: Before you do this, you should always seek detailed legal advice as proving constructive dismissal can often be difficult
ga: Sula ndéanann tú é sin, ba chóir duit comhairle dhlíthiúil mhionsonraithe a fháil i gcónaí mar is minic a bhíonn sé deacair dífhostú inchiallaithe a chruthú

source: If you are regularly being paid late, you can either make a complaint under the Industrial Relations Acts 1969-2015 or you can bring a complaint under the Terms of Employment (Information) Act 1994 and 2001. You must use the online complaint form available on workplacerelations.ie)
ga: Má tá tú á íoc déanach go rialta, is féidir leat gearán a dhéanamh leis an gCoimisinéir um Chearta faoi na hAchtanna Caidrimh Thionscail 1969-2001 nó faoin Acht um Théarmaí Fostaíochta (Faisnéis) 1994 agus 2001 ag baint úsáide as an fhoirm ghearáin ar líne nua a úsáid á fáil ar workplacerelations.ie)

source: You must make the complaint while you are in employment or within 6 months of leaving your employment
ga: Ní mór duit an gearán a dhéanamh agus tú fostaithe nó laistigh de 6 mhí ón dáta a d’fhág tú do chuid fostaíochta

source: For further information about your employment rights contact the Workplace Relations Commission's Information and Customer Service - see 'Where to apply' below. Where to apply Workplace Relations Commission Information and Customer Service O'Brien Road Carlow R93 W7W2 Ireland Opening Hours: Mon. to Fri
ga: Le haghaidh tuilleadh eolais faoi do chearta fostaíochta déan teagmháil leis an tSeirbhís Fhaisnéise agus Custaiméara an Choimisiúin um Chaidreamh san Áit Oibre – féach ‘Cá háit a ndéanfaidh mé iarratas’ thíos
